src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/НастройкиПользователей/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ЗапомнитьИсходныйКлюч(ТекущийОбъект);

КонецПроцедуры

// Смена пользователя или вида настройки в форме удаляет запись со старым ключом. Если старая запись - право группы
// «Настройки доступа», это снятие права: не-администратору отказ (SEC-2). Сама новая запись проверяется в модуле
// набора записей регистра.
//
// Параметры:
//  Отказ           - Булево - отказ от записи.
//  ТекущийОбъект   - РегистрСведенийМенеджерЗаписи.НастройкиПользователей - записываемая запись.
//  ПараметрыЗаписи - Структура - параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	КлючМеняется = ЗначениеЗаполнено(ИсходнаяНастройка)
		И (ТекущийОбъект.Пользователь <> ИсходныйПользователь Или ТекущийОбъект.Настройка <> ИсходнаяНастройка);
	Если Не КлючМеняется Тогда
		Возврат;
	КонецЕсли;
	Менеджер = РегистрыСведений.НастройкиПользователей;
	Если Не Менеджер.ЭтоАдминистраторНастроек()
		И Менеджер.УдалениеЗаписиМеняетПраваДоступа(ИсходныйПользователь, ИсходнаяНастройка) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр(
			"ru = 'Права пользователей (группа «Настройки доступа») меняет только администратор.';
			|fr = 'Seul l''administrateur modifie les droits des utilisateurs (groupe « Paramètres d''accès »).';
			|en = 'Only the administrator can change user rights (the ""Access settings"" group).';
			|es = 'Solo el administrador puede cambiar los derechos de los usuarios (grupo «Configuración de acceso»).'"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ЗапомнитьИсходныйКлюч(ТекущийОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  ТекущийОбъект - РегистрСведенийМенеджерЗаписи.НастройкиПользователей - прочитанная или записанная запись.
//
&НаСервере
Процедура ЗапомнитьИсходныйКлюч(ТекущийОбъект)

	ИсходныйПользователь = ТекущийОбъект.Пользователь;
	ИсходнаяНастройка = ТекущийОбъект.Настройка;

КонецПроцедуры

#КонецОбласти
